test-resources/sample-request-with-headers.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope">
    <SOAP-ENV:Header>
        <Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <Assertion xmlns="urn:oasis:names:tc:SAML:2.0:assertion"
                       ID="d2" IssueInstant="2011-12-05T17:55:45.199Z" Version="2.0">
                <Issuer Format="urn:unknown"/>
                <Subject>
                    <SubjectConfirmation
                            Method="urn:oasis:names:tc:SAML:2.0:cm:sender-vouches">
                        <SubjectConfirmationData NotBefore="2011-12-05T16:56:07.438Z"
                                                 NotOnOrAfter="2011-12-05T18:56:07.438Z"/>
                    </SubjectConfirmation>
                    <NameID Format="urn:mein-format">me</NameID>
                </Subject>
                <AuthnStatement AuthnInstant="2011-12-05T17:55:45.199Z">
                    <AuthnContext>
                        <AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:unknown</AuthnContextClassRef>
                    </AuthnContext>
                </AuthnStatement>
            </Assertion>
        </Security>
        <wsa:MessageID xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">urn:uuid:5bb38378-d09b-4822-be57-8c1075a328c3
        </wsa:MessageID>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <svc:GetPartTypeRequest xmlns:svc="http://example.com/svc">
            <part>widget</part>
        </svc:GetPartTypeRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
